zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/include/stm32h5xx_hal_gfxtim.h
  uint32_t LCCClockSrc;         /*!< Line Clock Counter Clock Source
                                This parameter can be a value of @ref GFXTIM_LCCClockSrc */

  uint32_t LineClockSrc;        /*!< Line Clock Source
                                This parameter can be a value of @ref GFXTIM_LineClockSrc */

  uint32_t FCCHwReloadSrc;      /*!< Frame Clock Counter hardware reload source
                                This parameter can be a value of @ref GFXTIM_FCCHwReloadSrc */

  uint32_t FCCReloadValue;      /*!< Frame Clock Counter reload value (12 bits)
                                This parameter must be a number between Min_Data = 1 and Max_Data = 4095 */

  uint32_t FCCClockSrc;         /*!< Frame Clock Counter Clock Source
                                This parameter can be a value of @ref GFXTIM_FCCClockSrc */

  uint32_t FrameClockSrc;       /*!< Frame Clock Source
                                This parameter can be a value of @ref GFXTIM_FrameClockSrc */

  uint32_t LineClockCalib;      /*!< Debug purpose
                                This parameter can be a value of @ref GFXTIM_LineClockCalib */

  uint32_t FrameClockCalib;     /*!< Debug purpose
                                This parameter can be a value of @ref GFXTIM_FrameClockCalib */
} GFXTIM_ClockGeneratorConfigTypeDef;

/**
  * @brief  GFXTIM absolute timer configuration structure
  */
typedef struct
{
  uint32_t FrameCompare1Value;      /*!< Absolute Frame Compare 1 value (20 bits)
                                    This parameter must be a number between 1 and 1048575 */

  uint32_t FrameCounterValue;       /*!< Absolute Frame Counter initial value (20 bits)
                                    This parameter must be a number between 1 and 1048575 */

  uint32_t FrameOverflowInterrupt;  /*!< Absolute Frame Counter Overflow Interrupt Enable or Disable
                                    This parameter can be a value of @ref GFXTIM_Interrupt */

  uint32_t FrameCompare1Interrupt;  /*!< Absolute Frame Compare 1 Interrupt Enable or Disable
                                    This parameter can be a value of @ref GFXTIM_Interrupt */

  uint32_t LineCompare1Value;       /*!< Absolute Line Compare 1 value (12 bits)
                                    This parameter must be a number between 1 and 4095 */

  uint32_t LineCompare2Value;       /*!< Absolute Line Compare 2 value (12 bits)
                                    This parameter must be a number between 1 and 4095 */

  uint32_t LineCounterValue;        /*!< Absolute Line Counter value (12 bits)
                                    This parameter must be a number between 1 and 4095 */

  uint32_t LineOverflowInterrupt;   /*!< Absolute Line Counter Overflow Interrupt Enable or Disable
                                    This parameter can be a value of @ref GFXTIM_Interrupt */

  uint32_t LineCompare1Interrupt;   /*!< Absolute Line Compare 1 Interrupt Enable or Disable
                                    This parameter can be a value of @ref GFXTIM_Interrupt */

  uint32_t LineCompare2Interrupt;   /*!< Absolute Line Compare 2 Interrupt Enable or Disable
                                    This parameter can be a value of @ref GFXTIM_Interrupt */
} GFXTIM_AbsoluteTimerConfigTypeDef;


/**
  * @brief  GFXTIM relative timer configuration structure
  */
typedef struct
{
  uint32_t AutoReloadValue;      /*!< Auto reload value (12 bits)
                                 This parameter must be a number between 1 and 4095 */

  uint32_t CounterMode;          /*!< Counter Mode
                                 This parameter can be a value of GFXTIM_RelativeCounterMode */
  uint32_t ReloadInterrupt;      /*!< Relative Frame Counter Reload Interrupt Enable or Disable
                                 This parameter can be a value of @ref GFXTIM_Interrupt */
} GFXTIM_RelativeTimerConfigTypeDef;


/**
  * @brief  GFXTIM event generator configuration structure
  */
typedef struct
{
  uint32_t LineEvent;          /*!< Line event selection
                               This parameter can be a value of GFXTIM_EventLine */

  uint32_t FrameEvent;         /*!< Frmae event selection
                               This parameter can be a value of GFXTIM_EventFrame */

  uint32_t EventInterrupt;     /*!< Event interrupt Enable or Disable
                               This parameter can be a value of @ref GFXTIM_Interrupt */
} GFXTIM_EventGeneratorConfigTypeDef;

/**
  * @brief  GFXTIM watchdog configuration structure
  */
typedef struct
{
  uint32_t ClockSrc;          /*!< Clock source
                              This parameter can be a value of GFXTIM_WatchdogClockSrc */

  uint32_t AutoReloadValue;   /*!< Reload value (16 bits)
                              This parameter must be a number between 1 and 65535 */

  uint32_t HwReloadConfig;    /*!< Hardware reload configuration
                              This parameter can be a value of GFXTIM_WatchdogHwReloadConfig */

  uint32_t PreAlarmValue;     /*!< Pre-alarm value (16 bits)
                              This parameter must be a number between 1 and 65535 */

  uint32_t AlarmInterrupt;    /*!< Interrupt Enable or Disable when watchdog counter reaches 0
                              This parameter can be a value of @ref GFXTIM_Interrupt */

  uint32_t PreAlarmInterrupt; /*!< Interrupt Enable or Disable when watchdog counter reaches pre-alarm value
                               This parameter can be a value of @ref GFXTIM_Interrupt */
} GFXTIM_WatchdogConfigTypeDef;

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup GFXTIM_Exported_Constants GFXTIM Exported Constants
  * @{
  */

/** @defgroup GFXTIM_ErrorCode GFXTIM Error Code
  * @{
  */
#define GFXTIM_ERROR_NONE                      0U /*!< No error */
#define GFXTIM_ERROR_STATE                     1U /*!< State error */
#if (USE_HAL_GFXTIM_REGISTER_CALLBACKS == 1)
#define GFXTIM_ERROR_INVALID_CALLBACK          2U /*!< Invalid callback error occurs */
#endif /* USE_HAL_GFXTIM_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @defgroup GFXTIM_Interrupt GFXTIM Interrupt
  * @{
  */
#define GFXTIM_IT_DISABLE                   0U    /*!< gfxtim_interrupt disable */
#define GFXTIM_IT_ENABLE                    1U    /*!< gfxtim_interrupt enable */

/**
  * @}
  */

/** @defgroup GFXTIM_SynchroSrc GFXTIM Synchronization Source
  * @{
  */
#define GFXTIM_SYNC_SRC_HSYNC_VSYNC_0    0U                                       /*!< gfxtim_hsync[0] and gfxtim_vsync[0] are used as synchronization source */
#define GFXTIM_SYNC_SRC_HSYNC_VSYNC_1    GFXTIM_CR_SYNCS_0                        /*!< gfxtim_hsync[1] and gfxtim_vsync[1] are used as synchronization source */
#define GFXTIM_SYNC_SRC_HSYNC_VSYNC_2    GFXTIM_CR_SYNCS_1                        /*!< gfxtim_hsync[2] and gfxtim_vsync[2] are used as synchronization source */
#define GFXTIM_SYNC_SRC_HSYNC_VSYNC_3    (GFXTIM_CR_SYNCS_0 | GFXTIM_CR_SYNCS_1)  /*!< gfxtim_hsync[3] and gfxtim_vsync[3] are used as synchronization source */
/**
  * @}
  */

